# Lista semana 7 - Pandas 2

In [1]:
import pandas as pd

## Exercício 1:
Dado o seguinte DataFrame:

In [2]:
data = {'Nome': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Pedro', 'Jonas', 'Ana', 'Sofia'],
        'Idade': [25, 30, 22, 35, 28, 19, 27, 39, 29],
        'Salário': [4000, 4500, 3500, 5500, 4800, 3000, 6000, 5000, 4500]}

df = pd.DataFrame(data)

a) Use a função loc para selecionar as linhas correspondentes aos indivíduos com idades entre 25 e 30 anos.

In [3]:
lock = df.loc[df['Idade'] <= 30]
lock.loc[lock['Idade'] >= 25]

    Nome  Idade  Salário
0  Alice     25     4000
1    Bob     30     4500
4    Eva     28     4800
6  Jonas     27     6000
8  Sofia     29     4500

b) Use a função iloc para selecionar as linhas correspondentes aos indivíduos na primeira e última posição do DataFrame e tire a média de seus salários.

In [4]:
a = df.iloc[0, 2]
b = df.iloc[-1, 2]

media = (a+b)/2
print(media)

4250.0

## Exercício 2:
Dado o seguinte DataFrame:

In [5]:
data = {'Categoria': ['A', 'B', 'A', 'C', 'B', 'A', 'B', 'A', 'C', 'C', 'B', 'A'],
        'Valor': [100, 200, 150, 300, 250, 120, 140, 230, 390, 80, 160, 210]}

df = pd.DataFrame(data)

a) Calcule a média dos valores para cada categoria.

In [6]:
grouped_df = df.groupby('Categoria').mean()

print(grouped_df)

                Valor
Categoria
A          162.000000
B          187.500000
C          256.666667

b) Calcule a soma dos valores para cada categoria. O que possui a maior soma também possui a maior média? Qual a razão disso ocorrer ou não?

In [7]:
grouped = df.groupby('Categoria').sum()

print(grouped)

           Valor
Categoria
A            810
B            750
C            770

Não necessariamente a classe com a maior media é a com a maior soma, pois quantidade de elementos por classe é diferente

## Exercício 3:
Dado o seguinte DataFrame:

In [8]:
data = {'Data': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'Produto': ['A', 'B', 'A', 'B'],
        'Vendas': [100, 150, 200, 120]}

df = pd.DataFrame(data)

Crie uma tabela dinâmica (pivot table) que mostre as vendas totais para cada produto em cada data.

In [9]:
pivot_table = pd.pivot_table(df, values='Vendas', index='Data', columns='Produto', aggfunc='sum')

print(pivot_table)

Produto       A    B
Data
2023-01-01  100  150
2023-01-02  200  120

## Exercício 4:
Dado os seguintes DataFrames:

In [10]:
df1 = pd.DataFrame({'Chave': ['A', 'B', 'C', 'D'],
                    'Valor1': [10, 12, 6, 4]})

df2 = pd.DataFrame({'Chave': ['B', 'D', 'E', 'F'],
                    'Valor2': [9, 6, 11, 8]})

df3 = pd.DataFrame({'Chave': ['C', 'D', 'E', 'G'],
                    'Valor3': [10, 7, 14, 15]})

a) Combine os DataFrames df1 e df2 com base na coluna 'Chave', e deixe a coluna chave como index. Inclua apenas as chaves que aparecem em ambos os dataframes

In [11]:
merged_df = pd.merge(df1, df2, on='Chave')
merged_df.set_index('Chave', inplace=True)

merged_df

       Valor1  Valor2
Chave
B          12       9
D           4       6

b) Combine os DataFrames df1, df2 e df3, incluindo todas as chaves e valores. Defina "Chave" como index e substitua os valores não existentes por 0.

In [12]:
merged = pd.merge(df1, df2, on='Chave', how = 'outer')
merged = pd.merge(merged, df3, on='Chave', how = 'outer')
merged

  Chave  Valor1  Valor2  Valor3
0     A    10.0     NaN     NaN
1     B    12.0     9.0     NaN
2     C     6.0     NaN    10.0
3     D     4.0     6.0     7.0
4     E     NaN    11.0    14.0
5     F     NaN     8.0     NaN
6     G     NaN     NaN    15.0

In [13]:
merged.set_index('Chave', inplace=True)
merged.fillna(0, inplace=True)
merged

       Valor1  Valor2  Valor3
Chave
A        10.0     0.0     0.0
B        12.0     9.0     0.0
C         6.0     0.0    10.0
D         4.0     6.0     7.0
E         0.0    11.0    14.0
F         0.0     8.0     0.0
G         0.0     0.0    15.0

c) Adicione uma nova coluna ao dataframe, contendo a soma do valor 1, 2 e 3 para cada chave.

In [14]:
merged['Total'] = merged.sum(axis=1)
merged

       Valor1  Valor2  Valor3  Total
Chave
A        10.0     0.0     0.0   10.0
B        12.0     9.0     0.0   21.0
C         6.0     0.0    10.0   16.0
D         4.0     6.0     7.0   17.0
E         0.0    11.0    14.0   25.0
F         0.0     8.0     0.0    8.0
G         0.0     0.0    15.0   15.0

## Exercício 5
Vamos importar dados de ações utilizando a biblioteca Yahoo Finance, e você trabalhará em cima deste dataframe.

In [36]:
# importando a biblioteca:
import yfinance as yf


ticker_symbol = ["BBAS3.SA"]  # Substitua pela ação de sua escolha, se quiser
start_date = "2020-06-01"
end_date = "2023-06-01"
#dataframe:
data = yf.download(ticker_symbol, start=start_date, end=end_date)

[*********************100%%**********************]  1 of 1 completed

a) Faça um novo dataframe, contendo as colunas de preço de fechamento ajustado ('Adj Close') e de volume de negociações ('Volume').

In [38]:
columns_to_drop = ['Open', 'High', 'Low', 'Close']
data.drop(columns=columns_to_drop, inplace=True)
data

            Adj Close    Volume
Date
2020-06-01  25.010443  22043600
2020-06-02  25.812664  15772200
2020-06-03  27.330593  29497200
2020-06-04  27.480028  23947100
2020-06-05  27.684515  35546100
...               ...       ...
2023-05-25  42.787670  11695400
2023-05-26  42.538574   9590300
2023-05-29  42.461922   3307900
2023-05-30  42.825993  18427000
2023-05-31  42.749348  17425400

[746 rows x 2 columns]

b) Em qual dia a ação atingiu sua maior cotação?

In [39]:
max_index = data['Adj Close'].idxmax()
max_index

Timestamp('2023-05-30 00:00:00')

c) Em qual dia a ação foi mais negociada?

In [40]:
max_index = data['Volume'].idxmax()
max_index

Timestamp('2021-02-22 00:00:00')

d) Adicione uma coluna no dataframe, contendo a variação percentual da cotação da ação

In [42]:
data['Variação percentual'] = data['Adj Close'].pct_change()*100
data

            Adj Close    Volume  Variação percentual
Date
2020-06-01  25.010443  22043600                  NaN
2020-06-02  25.812664  15772200             3.207545
2020-06-03  27.330593  29497200             5.880560
2020-06-04  27.480028  23947100             0.546768
2020-06-05  27.684515  35546100             0.744129
...               ...       ...                  ...
2023-05-25  42.787670  11695400             0.112085
2023-05-26  42.538574   9590300            -0.582168
2023-05-29  42.461922   3307900            -0.180195
2023-05-30  42.825993  18427000             0.857406
2023-05-31  42.749348  17425400            -0.178968

[746 rows x 3 columns]

e) Calcule o retorno anualizado médio da ação. Considere que um ano possui 252 dias úteis em média.

In [47]:
a = data['Adj Close'].pct_change(periods =252)
a

Date
2020-06-01         NaN
2020-06-02         NaN
2020-06-03         NaN
2020-06-04         NaN
2020-06-05         NaN
                ...
2023-05-25    0.238857
2023-05-26    0.251346
2023-05-29    0.256738
2023-05-30    0.271235
2023-05-31    0.283003
Name: Adj Close, Length: 746, dtype: float64

## QUESTÃO 6

Você tem um DataFrame com informações sobre produtos em um estoque, incluindo nomes de produtos, preços e quantidades em estoque. Resolva as seguintes tarefas:

a) Agrupe os produtos por categoria e calcule a média e a mediana dos preços por categoria.

In [52]:
data = {'Produto': ['A', 'B', 'C', 'D', 'E'],
        'Categoria': ['Eletrônicos', 'Roupas', 'Eletrônicos', 'Roupas', 'Eletrônicos'],
        'Preço': [1000, 50, 800, 30, 1200],
        'Quantidade_Estoque': [10, 15, 5, 8, 12]}

df = pd.DataFrame(data)
grouped = df.groupby('Categoria')['Preço'].mean()

grouped

Categoria
Eletrônicos    1000.0
Roupas           40.0
Name: Preço, dtype: float64

In [53]:
df.groupby('Categoria')['Preço'].median()

Categoria
Eletrônicos    1000.0
Roupas           40.0
Name: Preço, dtype: float64

b) Encontre o produto mais caro em estoque.

In [56]:
df.groupby('Produto')['Preço'].max()

Produto
A    1000
B      50
C     800
D      30
E    1200
Name: Preço, dtype: int64

Produto E é o mais caro

## QUESTÃO 7

Suponha que você tenha um DataFrame com informações sobre jogos de video game, incluindo o nome do jogo, a plataforma em que ele foi lançado e sua classificação. Realize as seguintes tarefas:

a) Crie um DataFrame a partir dos seguintes dados:

In [23]:
data = {'Nome_Jogo': ['Super Mario Odyssey', 'The Legend of Zelda', 'FIFA 22', 'Call of Duty: Warzone'],
        'Plataforma': ['Nintendo Switch', 'Nintendo Switch', 'PlayStation 5', 'Xbox Series X'],
        'Classificacao': ['E', 'E', 'E', 'M']}

In [24]:
### seu código começa aqui###

b) Agrupe os jogos por plataforma e conte quantos jogos estão disponíveis em cada plataforma.

In [25]:
### seu código começa aqui###

c) Encontre a plataforma com a maior quantidade de jogos.

In [26]:
### seu código começa aqui###

## QUESTÃO 8

Você possui um DataFrame com informações sobre espécies de árvores encontradas em diferentes estados do Brasil. O DataFrame possui as colunas 'Estado', 'Espécie', 'Quantidade', e 'Altura Média'. Crie uma análise de dados para responder às seguintes perguntas e aprenda algumas curiosidades interessantes sobre as árvores do Brasil:

In [27]:
import pandas as pd

data = {'Estado': ['São Paulo', 'São Paulo', 'Rio de Janeiro', 'Rio de Janeiro', 'Minas Gerais'],
        'Espécie': ['Ipê Amarelo', 'Ipê Roxo', 'Ipê Amarelo', 'Ipê Roxo', 'Quaresmeira'],
        'Quantidade': [100, 50, 80, 40, 70],
        'Altura Média': [8, 7, 7, 6, 10]}

df = pd.DataFrame(data)

a) Qual é a espécie de árvore mais comum em cada estado? Mostre uma lista com o nome do estado e a espécie mais comum.

In [28]:
### seu código começa aqui###

b) Qual é a altura média das árvores por espécie? Apresente uma tabela que lista as espécies e suas alturas médias.

In [29]:
### seu código começa aqui###

c) Qual é o estado com a maior altura média de árvores? Mostre o nome do estado e sua altura média.

In [30]:
### seu código começa aqui###

d) Qual é o estado com a maior quantidade total de árvores? Mostre o nome do estado e a quantidade total de árvores.

In [31]:
### seu código começa aqui###

e) Qual é a espécie de árvore com a menor altura média? Mostre o nome da espécie e sua altura média.

In [32]:
### seu código começa aqui###

# DESAFIO

Você possui um DataFrame com informações sobre uma temporada da Fórmula 1. O DataFrame contém as colunas 'Piloto', 'Equipe', 'Pontuação' e 'Vitórias'. Sua tarefa é encontrar o melhor piloto da temporada com base em sua pontuação e número de vitórias.

In [33]:
import pandas as pd

data = {'Piloto': ['Lewis Hamilton', 'Max Verstappen', 'Charles Leclerc', 'Lando Norris', 'Valtteri Bottas'],
        'Equipe': ['Mercedes', 'Red Bull Racing', 'Ferrari', 'McLaren', 'Mercedes'],
        'Pontuação': [385, 391, 334, 256, 221],
        'Vitórias': [10, 9, 6, 3, 2]}

df = pd.DataFrame(data)

Encontre o melhor piloto da temporada de acordo com a pontuação e número de vitórias. O melhor piloto é aquele que tem a maior pontuação e, em caso de empate na pontuação, o maior número de vitórias.

In [34]:
### seu código começa aqui###